In [1]:
import pandas as pd  # importing library

In [3]:
dict = {"model":["city","alto","wagonr"],"price":["10lakhs","3lakhs","4lakhs"]} # created a dictionary

In [4]:
pd.DataFrame(dict) # converting the dictionary into dataframe

    model    price
0    city  10lakhs
1    alto   3lakhs
2  wagonr   4lakhs

In [8]:
pd.read_csv("plan.csv") # importing data from a csv dataset

,DATE_TIME,PLANT_ID,SOURCE_KEY,DC_POWER,AC_POWER,DAILY_YIELD,TOTAL_YIELD
0,15-05-2020 00:00,4135001,1BY6WEcLGh8j5v7,0.0,0.0,0.000,6259559.0
1,15-05-2020 00:00,4135001,1IF53ai7Xc0U56Y,0.0,0.0,0.000,6183645.0
2,15-05-2020 00:00,4135001,3PZuoBAID5Wc2HD,0.0,0.0,0.000,6987759.0
3,15-05-2020 00:00,4135001,7JYdWkrLSPkdwr4,0.0,0.0,0.000,7602960.0
4,15-05-2020 00:00,4135001,McdE0feGgRqW7Ca,0.0,0.0,0.000,7158964.0
...,...,...,...,...,...,...,...
68773,17-06-2020 23:45,4135001,uHbuxQJl8lW7ozc,0.0,0.0,5967.000,7287002.0
68774,17-06-2020 23:45,4135001,wCURE6d3bPkepu2,0.0,0.0,5147.625,7028601.0
68775,17-06-2020 23:45,4135001,z9Y9gH1T5YWrNuG,0.0,0.0,5819.000,7251204.0
68776,17-06-2020 23:45,4135001,zBIq5rxdHJRwDNY,0.0,0.0,5817.000,6583369.0
68777,17-06-2020 23:45,4135001,zVJPv84UY57bAof,0.0,0.0,5910.000,7363272.0

In [12]:
data = pd.read_csv("plan.csv")

In [13]:
data.head() # displays first 5 rows

,DATE_TIME,PLANT_ID,SOURCE_KEY,DC_POWER,AC_POWER,DAILY_YIELD,TOTAL_YIELD
0,15-05-2020 00:00,4135001,1BY6WEcLGh8j5v7,0.0,0.0,0.0,6259559.0
1,15-05-2020 00:00,4135001,1IF53ai7Xc0U56Y,0.0,0.0,0.0,6183645.0
2,15-05-2020 00:00,4135001,3PZuoBAID5Wc2HD,0.0,0.0,0.0,6987759.0
3,15-05-2020 00:00,4135001,7JYdWkrLSPkdwr4,0.0,0.0,0.0,7602960.0
4,15-05-2020 00:00,4135001,McdE0feGgRqW7Ca,0.0,0.0,0.0,7158964.0

In [19]:
data.head(7) # displays first 7 rows

,DATE_TIME,PLANT_ID,SOURCE_KEY,DC_POWER,AC_POWER,DAILY_YIELD,TOTAL_YIELD
0,15-05-2020 00:00,4135001,1BY6WEcLGh8j5v7,0.0,0.0,0.0,6259559.0
1,15-05-2020 00:00,4135001,1IF53ai7Xc0U56Y,0.0,0.0,0.0,6183645.0
2,15-05-2020 00:00,4135001,3PZuoBAID5Wc2HD,0.0,0.0,0.0,6987759.0
3,15-05-2020 00:00,4135001,7JYdWkrLSPkdwr4,0.0,0.0,0.0,7602960.0
4,15-05-2020 00:00,4135001,McdE0feGgRqW7Ca,0.0,0.0,0.0,7158964.0
5,15-05-2020 00:00,4135001,VHMLBKoKgIrUVDU,0.0,0.0,0.0,7206408.0
6,15-05-2020 00:00,4135001,WRmjgnKYAwPKWDb,0.0,0.0,0.0,7028673.0

In [20]:
data.shape # number of rows and columns

(68778, 7)

In [24]:
data.info() # information on the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68778 entries, 0 to 68777
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DATE_TIME    68778 non-null  object
 1   PLANT_ID     68778 non-null  int64
 2   SOURCE_KEY   68778 non-null  object
 3   DC_POWER     68778 non-null  float64
 4   AC_POWER     68778 non-null  float64
 5   DAILY_YIELD  68778 non-null  float64
 6   TOTAL_YIELD  68778 non-null  float64
dtypes: float64(4), int64(1), object(2)
memory usage: 3.7+ MB

In [26]:
data.columns # displays all the columns

Index(['DATE_TIME', 'PLANT_ID', 'SOURCE_KEY', 'DC_POWER', 'AC_POWER',
       'DAILY_YIELD', 'TOTAL_YIELD'],
      dtype='object')

In [35]:
data["TOTAL_YIELD"].value_counts() # gives the no of distinct elements present in column "TOTAL_YIELD"

6555136.000    49
6340538.000    48
7071198.000    48
7239542.000    48
7201349.000    48
               ..
6542371.571     1
6499226.429     1
7356891.250     1
7233209.286     1
6291471.000     1
Name: TOTAL_YIELD, Length: 37267, dtype: int64

In [38]:
data["PLANT_ID"].unique() # gives the distinct elements present in the column "PLANT_ID"

array([4135001], dtype=int64)

In [39]:
data["PLANT_ID"] # gives the column "PLANT_ID"

0        4135001
1        4135001
2        4135001
3        4135001
4        4135001
          ...
68773    4135001
68774    4135001
68775    4135001
68776    4135001
68777    4135001
Name: PLANT_ID, Length: 68778, dtype: int64

In [54]:
data.iloc[3:90,:6] # accessing rows using indexes

,DATE_TIME,PLANT_ID,SOURCE_KEY,DC_POWER,AC_POWER,DAILY_YIELD
3,15-05-2020 00:00,4135001,7JYdWkrLSPkdwr4,0.0,0.0,0.0
4,15-05-2020 00:00,4135001,McdE0feGgRqW7Ca,0.0,0.0,0.0
5,15-05-2020 00:00,4135001,VHMLBKoKgIrUVDU,0.0,0.0,0.0
6,15-05-2020 00:00,4135001,WRmjgnKYAwPKWDb,0.0,0.0,0.0
7,15-05-2020 00:00,4135001,ZnxXDlPa8U1GXgE,0.0,0.0,0.0
...,...,...,...,...,...,...
85,15-05-2020 01:00,4135001,1IF53ai7Xc0U56Y,0.0,0.0,0.0
86,15-05-2020 01:00,4135001,3PZuoBAID5Wc2HD,0.0,0.0,0.0
87,15-05-2020 01:00,4135001,7JYdWkrLSPkdwr4,0.0,0.0,0.0
88,15-05-2020 01:00,4135001,McdE0feGgRqW7Ca,0.0,0.0,0.0
89,15-05-2020 01:00,4135001,VHMLBKoKgIrUVDU,0.0,0.0,0.0

In [90]:
8data.loc[1:6,["PLANT_ID","DAILY_YIELD"]] # accessing rows using both indexes and column name

   PLANT_ID  DAILY_YIELD
1   4135001          0.0
2   4135001          0.0
3   4135001          0.0
4   4135001          0.0
5   4135001          0.0
6   4135001          0.0

In [58]:
data.sort_values("PLANT_ID") # sort in ascending order

,DATE_TIME,PLANT_ID,SOURCE_KEY,DC_POWER,AC_POWER,DAILY_YIELD,TOTAL_YIELD
0,15-05-2020 00:00,4135001,1BY6WEcLGh8j5v7,0.0,0.0,0.0,6259559.0
45842,07-06-2020 02:45,4135001,adLQvlD726eNBSB,0.0,0.0,0.0,6445031.0
45843,07-06-2020 02:45,4135001,bvBOhCH3iADSZry,0.0,0.0,0.0,6473124.0
45844,07-06-2020 02:45,4135001,iCRJl6heRkivqQ3,0.0,0.0,0.0,7348234.0
45845,07-06-2020 02:45,4135001,ih0vzX44oOqAx2f,0.0,0.0,0.0,6350673.0
...,...,...,...,...,...,...,...
22933,26-05-2020 18:30,4135001,ZnxXDlPa8U1GXgE,0.0,0.0,0.0,6612649.0
22934,26-05-2020 18:30,4135001,ZoEaEvLYb1n2sOq,0.0,0.0,0.0,7186690.0
22935,26-05-2020 18:30,4135001,adLQvlD726eNBSB,0.0,0.0,0.0,6363516.0
22921,26-05-2020 18:15,4135001,wCURE6d3bPkepu2,0.0,0.0,7835.0,6872485.0
68777,17-06-2020 23:45,4135001,zVJPv84UY57bAof,0.0,0.0,5910.0,7363272.0

In [65]:
dict_1 = {"name":["raj","john","sanket","das","deepika","mounika","maya","lal"],"sex":["male","male","male","male","female","female","female","male"]}

In [66]:
data1 = pd.DataFrame(dict_1)

In [67]:
data1

      name     sex
0      raj    male
1     john    male
2   sanket    male
3      das    male
4  deepika  female
5  mounika  female
6     maya  female
7      lal    male

In [73]:
data1["sex"].value_counts()

male      5
female    3
Name: sex, dtype: int64

In [92]:
data2 = data1.groupby("sex") # groupby function

In [93]:
data2.count() # count function

        name
sex
female     3
male       5

In [101]:
data2.size() # return size of data2

sex
female    3
male      5
dtype: int64

In [103]:
dict3 = pd.DataFrame({"k1":[1,4,3,5],"k2":[3,6,4,2],"k3":[5,7,3,1]})

In [104]:
dict3

   k1  k2  k3
0   1   3   5
1   4   6   7
2   3   4   3
3   5   2   1

In [108]:
dict3.sum(axis=0) # sum along rows

k1    13
k2    15
k3    16
dtype: int64

In [110]:
dict3.sum(axis=1) # sum along columns

0     9
1    17
2    10
3     8
dtype: int64

In [112]:
dict3.multiply(2) # multiply by 2

   k1  k2  k3
0   2   6  10
1   8  12  14
2   6   8   6
3  10   4   2

In [118]:
dict3.multiply([100,1,3,3],axis=0)

    k1   k2   k3
0  100  300  500
1    4    6    7
2    9   12    9
3   15    6    3

In [120]:
dict3.multiply([100,1,3],axis=1)

    k1  k2  k3
0  100   3  15
1  400   6  21
2  300   4   9
3  500   2   3

In [121]:
import numpy as np

In [168]:
x = pd.DataFrame({"s1":["sos","bos","aos","bos","tos"], "s2":[12,13,33,90,101], "s3":["q","w","e","r","t"]})

In [162]:
x["s1"]=="bos"

0    False
1     True
2    False
3     True
4    False
Name: s1, dtype: bool

In [163]:
x["s2"]>=13

0    False
1     True
2     True
3     True
4     True
Name: s2, dtype: bool

In [132]:
# string filter functions - 3 functions namely startswith(),endswith(),contains()

x["s1"].str.startswith("s")

0     True
1    False
2    False
3    False
4    False
Name: s1, dtype: bool

In [133]:
x["s1"].str.endswith("o")

0    False
1    False
2    False
3    False
4    False
Name: s1, dtype: bool

In [141]:
~x["s1"].str.contains("bos")  #  ~ indicates negation of the statement

0    False
1     True
2    False
3     True
4    False
Name: s1, dtype: bool

In [227]:
x["s1"].isna() # not a number (detects missing values)

0    False
1    False
2    False
3    False
4    False
Name: s1, dtype: bool

In [228]:
x["s1"].notna() # opposite of isna()

0    True
1    True
2    True
3    True
4    True
Name: s1, dtype: bool

In [178]:
x

    s1   s2 s3
0  sos   12  q
1  bos   13  w
2  aos   33  e
3  bos   90  r
4  tos  101  t

In [180]:
x.sort_values("s1") # sorting in ascending(default)

    s1   s2 s3
2  aos   33  e
1  bos   13  w
3  bos   90  r
0  sos   12  q
4  tos  101  t

In [184]:
x.sort_values("s1", ascending=False) # sorting in descending

    s1   s2 s3
4  tos  101  t
0  sos   12  q
1  bos   13  w
3  bos   90  r
2  aos   33  e

In [191]:
x.describe() # generate statistical report for numerical values

               s2
count    5.000000
mean    49.800000
std     42.728211
min     12.000000
25%     13.000000
50%     33.000000
75%     90.000000
max    101.000000